{
  "char_to_idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    " ": 4,
    "!": 5,
    "\"": 6,
    "#": 7,
    "$": 8,
    "%": 9,
    "&": 10,
    "'": 11,
    "(": 12,
    ")": 13,
    "*": 14,
    "+": 15,
    ",": 16,
    "-": 17,
    ".": 18,
    "/": 19,
    "0": 20,
    "1": 21,
    "2": 22,
    "3": 23,
    "4": 24,
    "5": 25,
    "6": 26,
    "7": 27,
    "8": 28,
    "9": 29,
    ":": 30,
    ";": 31,
    "<": 32,
    "=": 33,
    ">": 34,
    "?": 35,
    "@": 36,
    "A": 37,
    "B": 38,
    "C": 39,
    "D": 40,
    "E": 41,
    "F": 42,
    "G": 43,
    "H": 44,
    "I": 45,
    "J": 46,
    "K": 47,
    "L": 48,
    "M": 49,
    "N": 50,
    "O": 51,
    "P": 52,
    "Q": 53,
    "R": 54,
    "S": 55,
    "T": 56,
    "U": 57,
    "V": 58,
    "W": 59,
    "X": 60,
    "Y": 61,
    "Z": 62,
    "[": 63,
    "\\": 64,
    "]": 65,
    "^": 66,
    "_": 67,
    "`": 68,
    "a": 69,
    "b": 70,
    "c": 71,
    "d": 72,
    "e": 73,
    "f": 74,
    "g": 75,
    "h": 76,
    "i": 77,
    "j": 78,
    "k": 79,
    "l": 80,
    "m": 81,
    "n": 82,
    "o": 83,
    "p": 84,
    "q": 85,
    "r": 86,
    "s": 87,
    "t": 88,
    "u": 89,
    "v": 90,
    "w": 91,
    "x": 92,
    "y": 93,
    "z": 94,
    "{": 95,
    "|": 96,
    "}": 97,
    "~": 98,
    "À": 99,
    "Á": 100,
    "Â": 101,
    "Ã": 102,
    "È": 103,
    "É": 104,
    "Ê": 105,
    "Ì": 106,
    "Í": 107,
    "Ò": 108,
    "Ó": 109,
    "Ô": 110,
    "Õ": 111,
    "Ù": 112,
    "Ú": 113,
    "Ý": 114,
    "à": 115,
    "á": 116,
    "â": 117,
    "ã": 118,
    "è": 119,
    "é": 120,
    "ê": 121,
    "ì": 122,
    "í": 123,
    "ò": 124,
    "ó": 125,
    "ô": 126,
    "õ": 127,
    "ù": 128,
    "ú": 129,
    "ý": 130,
    "Ă": 131,
    "ă": 132,
    "Đ": 133,
    "đ": 134,
    "Ĩ": 135,
    "ĩ": 136,
    "Ũ": 137,
    "ũ": 138,
    "Ơ": 139,
    "ơ": 140,
    "Ư": 141,
    "ư": 142,
    "Ạ": 143,
    "ạ": 144,
    "Ả": 145,
    "ả": 146,
    "Ấ": 147,
    "ấ": 148,
    "Ầ": 149,
    "ầ": 150,
    "Ẩ": 151,
    "ẩ": 152,
    "Ẫ": 153,
    "ẫ": 154,
    "Ậ": 155,
    "ậ": 156,
    "Ắ": 157,
    "ắ": 158,
    "Ằ": 159,
    "ằ": 160,
    "Ẳ": 161,
    "ẳ": 162,
    "Ẵ": 163,
    "ẵ": 164,
    "Ặ": 165,
    "ặ": 166,
    "Ẹ": 167,
    "ẹ": 168,
    "Ẻ": 169,
    "ẻ": 170,
    "Ẽ": 171,
    "ẽ": 172,
    "Ế": 173,
    "ế": 174,
    "Ề": 175,
    "ề": 176,
    "Ể": 177,
    "ể": 178,
    "Ễ": 179,
    "ễ": 180,
    "Ệ": 181,
    "ệ": 182,
    "Ỉ": 183,
    "ỉ": 184,
    "Ị": 185,
    "ị": 186,
    "Ọ": 187,
    "ọ": 188,
    "Ỏ": 189,
    "ỏ": 190,
    "Ố": 191,
    "ố": 192,
    "Ồ": 193,
    "ồ": 194,
    "Ổ": 195,
    "ổ": 196,
    "Ỗ": 197,
    "ỗ": 198,
    "Ộ": 199,
    "ộ": 200,
    "Ớ": 201,
    "ớ": 202,
    "Ờ": 203,
    "ờ": 204,
    "Ở": 205,
    "ở": 206,
    "Ỡ": 207,
    "ỡ": 208,
    "Ợ": 209,
    "ợ": 210,
    "Ụ": 211,
    "ụ": 212,
    "Ủ": 213,
    "ủ": 214,
    "Ứ": 215,
    "ứ": 216,
    "Ừ": 217,
    "ừ": 218,
    "Ử": 219,
    "ử": 220,
    "Ữ": 221,
    "ữ": 222,
    "Ự": 223,
    "ự": 224,
    "Ỳ": 225,
    "ỳ": 226,
    "Ỵ": 227,
    "ỵ": 228,
    "Ỷ": 229,
    "ỷ": 230,
    "Ỹ": 231,
    "ỹ": 232
  },
  "idx_to_char": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "<BOS>",
    "3": "<EOS>",
    "4": " ",
    "5": "!",
    "6": "\"",
    "7": "#",
    "8": "$",
    "9": "%",
    "10": "&",
    "11": "'",
    "12": "(",
    "13": ")",
    "14": "*",
    "15": "+",
    "16": ",",
    "17": "-",
    "18": ".",
    "19": "/",
    "20": "0",
    "21": "1",
    "22": "2",
    "23": "3",
    "24": "4",
    "25": "5",
    "26": "6",
    "27": "7",
    "28": "8",
    "29": "9",
    "30": ":",
    "31": ";",
    "32": "<",
    "33": "=",
    "34": ">",
    "35": "?",
    "36": "@",
    "37": "A",
    "38": "B",
    "39": "C",
    "40": "D",
    "41": "E",
    "42": "F",
    "43": "G",
    "44": "H",
    "45": "I",
    "46": "J",
    "47": "K",
    "48": "L",
    "49": "M",
    "50": "N",
    "51": "O",
    "52": "P",
    "53": "Q",
    "54": "R",
    "55": "S",
    "56": "T",
    "57": "U",
    "58": "V",
    "59": "W",
    "60": "X",
    "61": "Y",
    "62": "Z",
    "63": "[",
    "64": "\\",
    "65": "]",
    "66": "^",
    "67": "_",
    "68": "`",
    "69": "a",
    "70": "b",
    "71": "c",
    "72": "d",
    "73": "e",
    "74": "f",
    "75": "g",
    "76": "h",
    "77": "i",
    "78": "j",
    "79": "k",
    "80": "l",
    "81": "m",
    "82": "n",
    "83": "o",
    "84": "p",
    "85": "q",
    "86": "r",
    "87": "s",
    "88": "t",
    "89": "u",
    "90": "v",
    "91": "w",
    "92": "x",
    "93": "y",
    "94": "z",
    "95": "{",
    "96": "|",
    "97": "}",
    "98": "~",
    "99": "À",
    "100": "Á",
    "101": "Â",
    "102": "Ã",
    "103": "È",
    "104": "É",
    "105": "Ê",
    "106": "Ì",
    "107": "Í",
    "108": "Ò",
    "109": "Ó",
    "110": "Ô",
    "111": "Õ",
    "112": "Ù",
    "113": "Ú",
    "114": "Ý",
    "115": "à",
    "116": "á",
    "117": "â",
    "118": "ã",
    "119": "è",
    "120": "é",
    "121": "ê",
    "122": "ì",
    "123": "í",
    "124": "ò",
    "125": "ó",
    "126": "ô",
    "127": "õ",
    "128": "ù",
    "129": "ú",
    "130": "ý",
    "131": "Ă",
    "132": "ă",
    "133": "Đ",
    "134": "đ",
    "135": "Ĩ",
    "136": "ĩ",
    "137": "Ũ",
    "138": "ũ",
    "139": "Ơ",
    "140": "ơ",
    "141": "Ư",
    "142": "ư",
    "143": "Ạ",
    "144": "ạ",
    "145": "Ả",
    "146": "ả",
    "147": "Ấ",
    "148": "ấ",
    "149": "Ầ",
    "150": "ầ",
    "151": "Ẩ",
    "152": "ẩ",
    "153": "Ẫ",
    "154": "ẫ",
    "155": "Ậ",
    "156": "ậ",
    "157": "Ắ",
    "158": "ắ",
    "159": "Ằ",
    "160": "ằ",
    "161": "Ẳ",
    "162": "ẳ",
    "163": "Ẵ",
    "164": "ẵ",
    "165": "Ặ",
    "166": "ặ",
    "167": "Ẹ",
    "168": "ẹ",
    "169": "Ẻ",
    "170": "ẻ",
    "171": "Ẽ",
    "172": "ẽ",
    "173": "Ế",
    "174": "ế",
    "175": "Ề",
    "176": "ề",
    "177": "Ể",
    "178": "ể",
    "179": "Ễ",
    "180": "ễ",
    "181": "Ệ",
    "182": "ệ",
    "183": "Ỉ",
    "184": "ỉ",
    "185": "Ị",
    "186": "ị",
    "187": "Ọ",
    "188": "ọ",
    "189": "Ỏ",
    "190": "ỏ",
    "191": "Ố",
    "192": "ố",
    "193": "Ồ",
    "194": "ồ",
    "195": "Ổ",
    "196": "ổ",
    "197": "Ỗ",
    "198": "ỗ",
    "199": "Ộ",
    "200": "ộ",
    "201": "Ớ",
    "202": "ớ",
    "203": "Ờ",
    "204": "ờ",
    "205": "Ở",
    "206": "ở",
    "207": "Ỡ",
    "208": "ỡ",
    "209": "Ợ",
    "210": "ợ",
    "211": "Ụ",
    "212": "ụ",
    "213": "Ủ",
    "214": "ủ",
    "215": "Ứ",
    "216": "ứ",
    "217": "Ừ",
    "218": "ừ",
    "219": "Ử",
    "220": "ử",
    "221": "Ữ",
    "222": "ữ",
    "223": "Ự",
    "224": "ự",
    "225": "Ỳ",
    "226": "ỳ",
    "227": "Ỵ",
    "228": "ỵ",
    "229": "Ỷ",
    "230": "ỷ",
    "231": "Ỹ",
    "232": "ỹ"
  },
  "vocab_size": 233,
  "special_tokens": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3
  }
}